#+TITLE:     Introduction to Hyper-V Pre-Planning and Planning
#+AUTHOR:    Brian Dewey
#+EMAIL:     bdewey@microsoft.com
#+DATE:      December 9, 2009
#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   H:3 toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:nil
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:nil pri:nil tags:nil
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 

* DONE Introduction
  CLOSED: [2009-12-09 Wed 15:18]
  CLOCK: [2009-12-09 Wed 15:00]--[2009-12-09 Wed 15:18] =>  0:18
  CLOCK: [2009-12-09 Wed 10:02]--[2009-12-09 Wed 10:14] =>  0:12

  The pre-planning activities for Hyper-V proceeded in three
  phases. In the first phase, we identified and wrote down a set of
  /business value propositions./ These are things we could pitch to
  customers as new value they would get from using Windows 8. To wrap
  up phase one, we worked with Mike Neil's team in Windows Server to
  rank the business value propositions. This step ensured that COSD
  and Windows Server operated from a common, agreed-upon set of
  priorities.

  For the second phase of pre-planning, we brainstormed all of the
  features we would need to implement to deliver on the value
  propositions from phase one. We captured a short description of each
  potential feature in a one-page spec.

  In the final phase of pre-planning, the dev team estimated how much
  dev effort would be required to implement each feature.

  By the numbers, our pre-planning work generated:

  - 19 different value propositions

  - 159 one-page specs 

  - A 770-line spreadsheet containing dev estimates

  - 4.5 times the amount of dev work than we can tackle in a single release

  Moving from pre-planning to planning, our objective has been to
  understand and to shape overall Windows priorities so we can pick
  the /right/ 20% of work to commit to for Windows 8.

  This document gives an overview of the different pre-planning
  activities we did. It provides pointers to the pre-planning
  artefacts we produced and shows how we've been able to map our
  pre-planning work into planning.

* Business Value Propositions
  CLOCK: [2009-12-07 Mon 09:09]--[2009-12-07 Mon 09:50] =>  0:41
  CLOSED: [2009-12-01 Tue 10:52]

  One of the first pre-planning activities we did in Hyper-V was
  define a set of /business value propositions/ (BVPs). A business value
  proposition is an end-to-end hook that can convince a customer that
  Windows 8 is worth buying. 

  Our BVPs are stored in the [[http://windows/hyper-v/initiatives/Value%20Propositions/Forms/AllItems.aspx][Hyper-V Portal]].

* DONE One-Page Specs
  SCHEDULED: <2009-12-07 Mon> CLOSED: [2009-12-07 Mon 16:39]
  CLOCK: [2009-12-07 Mon 16:26]--[2009-12-07 Mon 16:39] =>  0:13

  Armed with the prioritized list of customer value propositions to
  consider for Windows 8, we started work on the next level of detail:
  What features would we need to implement to deliver the value
  proposition? Two main tasks refined our thinking in this
  area. First, we brainstormed all of the features required to deliver
  the target level of value in the BVP. Then, to reduce ambiguity, we
  wrote a /one page spec/ for each feature. What exactly does
  /cross-cluster live migration/ mean? The one-page spec tells
  you. The goal of the one page spec was to capture just enough
  information that a developer could estimate how expensive the
  feature would be to implement. Our one-page spec library is [[http://windows/hyper-v/w8/Specs/Forms/AllItems.aspx][here]].

  #+BEGIN_QUOTE

  /Example: Cross-cluster live migration/

  Key customer scenario: An enterprise is building large scale Hyper-V
  based infrastructure to run vast majority of server workloads with
  High-Availability is a requirement.  Customer builds multiple
  clusters for one or more of the following business needs:

# NOTE, for formatting reasons, don't fill the following.

  - To keep cluster size to be manageable based on preconceived perception of node failure time is linearly proportional to cluster size,
  - Due to increased business need they need to build new cluster once maximum supported cluster size is reached,
  - There are departmental clusters and temporarily there is a need to use extra capacity of a cluster when one cluster experiences capacity peaks.

  Customer would like ability to live migrate, quick migrate or move
  VMs from one cluster to other cluster for above mentioned needs.

  The goal is to provide more flexibility in VM mobility space without
  cluster as a boundary.  Hyper-V needs to perform two operations in a
  transaction:

  - Live migrate VM from one cluster node to destination cluster node.
  - Live migrate VM’s storage from one cluster’s shared storage to another cluster’s shared storage.


  If any of the above fails, VM must continue to run on the source
  node.

  A user should be able to orchestrate live migration through Hyper-V
  manager, Failover cluster UI, WMI or Powershell.

  Live migration should perform necessary checks to ensure live
  migration requirements are met.  Some of the examples in addition to
  other migration checks are, performing estimation of time to migrate
  VM, access to the VM storage and same IP network on destination to
  ensure VM will be able to migrate successfully without dropping a
  TCP connection. If Hyper-V cannot reliably guaranty retaining TCP
  connection live migration should fail and must ensure VM continues
  to run on source node.

  Administrator should be able to set cluster wide, Hyper-V wide or
  per VM policies around allowing or denying live migrating one or
  more VMs from one cluster to any particular cluster or any other
  cluster.

  User experience and workflow of orchestrating live migration within
  a cluster or across the cluster site should be the same.


  #+END_QUOTE
* DONE Feature SWAGS
  CLOSED: [2009-12-09 Wed 08:57]
  CLOCK: [2009-12-09 Wed 08:46]--[2009-12-09 Wed 08:57] =>  0:11

  SCHEDULED: <2009-12-07 Mon>

  Using the one-page specs, the dev team estimated the dev time it
  would take to implement each feature identified to deliver on the
  business value propositions. The estimates are kept in this
  [[http://windows/hyper-v/w8/BVP/BVP%20Feature%20Expansion.xlsx][spreadsheet]]. The estimaes are fine-grained. To stretch an analogy,
  instead of t-shirt sizes, we've got estimates of the yards of thread
  required to make the t-shirt. For each feature we identified in the
  BVP process, the dev team estimated how to break apart the work and
  estimated the number of weeks of senior, mid-level, and junior dev
  time it would take to implement the feature.

  The key conclusion from the exercise: Our eyes are *way* bigger than
  our wallets. In the BVP process, we identified about five times as
  much work as we will be able to deliver in Windows 8.


* DONE Moving From Pre-Planning to Planning
  CLOSED: [2009-12-09 Wed 15:20]
  CLOCK: [2009-12-09 Wed 09:56]--[2009-12-09 Wed 10:01] =>  0:05
  CLOCK: [2009-12-09 Wed 09:00]--[2009-12-09 Wed 09:01] =>  0:01

  Pre-planning identified a significant amount of work we /could/ do
  in Windows 8. Our challenge in planning has been to identify the 20%
  of the work on our list that best aligns with the overall Windows
  vision, so we can commit to this as work we /will/ do for Windows 8.

  The business value propositions we defined in pre-planning lined up
  well with planning themes & subthemes. As we moved from pre-planning
  to planning, we narrowed down the list of BVPs that we focused on,
  and we worked through the established theme & subtheme
  planning. Through the Windows planning process, we have been able to
  work with our partner teams to find alignment on priorities.

  The following table shows how we mapped our BVPs to planning themes
  for the planning process.

   | BVP                                                                      | Planning Theme (Subtheme)                                                              |
   |--------------------------------------------------------------------------+----------------------------------------------------------------------------------------|
   | Resource-Smart Virtualization Infrastructure, Hosting, Cloud Integration | Infrastructure Scaled for SMB, Enterprise, & Service Providers (Hosted Private Clouds) |
   | Server High Availability                                                 | Continuous Availability (Contiuous Availability)                                       |
   | Server Disaster Recovery                                                 | Continuous Availability (Business Continuity)                                          |
   | Platform Extensibility                                                   | Big Bet: Scale for Datacenters                                                         |
   | Scale Up, Green IT                                                       | Infrastructure Scaled... (Leverage the Hardware Ecosystem)                             |
   | VDI                                                                      | Work Anywhere (Centralized Desktops)                                                   |
   | Deployment                                                               | Management (Solution Deployment)                                                       |
   | Server test/dev, Client test/dev                                         | Streamline the developer experience *or* Desktop for enthusiasts                       |
   | Appliance Development Model                                              | Infrastructure Scaled... (Virtual Appliance for Partners)                              |


  

